# Introduction to Pandas

## 1. What is Pandas?

Pandas is a powerful Python library for data analysis, providing efficient data structures and functions for data manipulation.

In [1]:
import numpy as np
import pandas as pd

### **Exercise:** Install pandas using `pip install pandas` (if not installed). Import pandas and print its version.


            ### **AI Prompt: Understanding Pandas**
            - Explain Pandas as if you're teaching a 10-year-old.
            - What are the key differences between Pandas and NumPy?
            - Why do we need Pandas in data analysis? Provide an example.

## 2. Pandas Objects - Series

Series is a one-dimensional indexed data structure in Pandas.

In [2]:
series1 = pd.Series([1, 2], index=['a', 'b'])
series2 = pd.Series({"a": 1, "b": 2})
print(series1)
print(series2)

a    1
b    2
dtype: int64
a    1
b    2
dtype: int64

In [3]:
series1.index

Index(['a', 'b'], dtype='object')

In [4]:
series2.values

array([1, 2])

### **Exercise:** Create a Series containing 5 city names as values and use index labels as country names.


            ### **AI Prompt: Exploring Pandas Series**
            - How does a Pandas Series differ from a Python list?
            - Can you provide a real-world example where using a Series is beneficial?
            - Generate additional exercises that explore Series operations.

## 3. Pandas Objects - DataFrame

DataFrame is a two-dimensional table with labeled rows and columns.

In [5]:
df1 = pd.DataFrame({'state': ['Ohio', 'California'], 'year': [2000, 2010]})
print(df1)

df2 = pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'])
print(df2)

        state  year
0        Ohio  2000
1  California  2010
        foo       bar
0  0.147877  0.341351
1  0.307340  0.332291
2  0.811849  0.993484

In [7]:
from pprint import pprint
pprint(df1)

        state  year
0        Ohio  2000
1  California  2010

In [9]:
df1.index

RangeIndex(start=0, stop=2, step=1)

In [10]:
df1.columns

Index(['state', 'year'], dtype='object')

In [11]:
df1.values

array([['Ohio', 2000],
       ['California', 2010]], dtype=object)

In [12]:
df2.values

array([[0.14787712, 0.34135106],
       [0.30734048, 0.33229077],
       [0.81184872, 0.9934836 ]])

In [13]:
df3 = pd.DataFrame(np.random.rand(3, 2), 
                   columns=['foo', 'bar'], 
                   index=['row1','row2','row3'])
pprint(df3)

           foo       bar
row1  0.152086  0.735880
row2  0.163763  0.846049
row3  0.351143  0.348980

In [14]:
students = {'name':["Ngọc", "Mai", "Lê", "Ngân"],
            'discrete_math':[9,10,9,8],
            'ecometrics':[9,10,7,9]}
df4 = pd.DataFrame(students)
print(df4)

   name  discrete_math  ecometrics
0  Ngọc              9           9
1   Mai             10          10
2    Lê              9           7
3  Ngân              8           9

### **Exercise:** Create a DataFrame with student names, their subjects, and corresponding grades.


            ### **AI Prompt: Working with DataFrames**
            - Compare a DataFrame with an SQL table. How are they similar and different?
            - What are some common operations performed on a DataFrame?
            - Describe a scenario where a DataFrame is more useful than a Series.

## 4. Indexing and Selection

Pandas provides various ways to select and retrieve data using `.loc[]` and `.iloc[]`.

In [16]:
s1 = pd.Series(range(10, 14), index=list("abcd"))
print(s1)
print(s1.loc['b'])
print(s1.iloc[1])

a    10
b    11
c    12
d    13
dtype: int64
11
11

In [17]:
s1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
import yfinance as yf

# Lấy dữ liệu của cổ phiếu AAPL
aapl = yf.Ticker("AAPL")

# Lấy dữ liệu lịch sử
history = aapl.history(period="1mo") # Lấy dữ liệu trong 1 tháng gần nhất

# In dữ liệu
print(history)

                                 Open        High         Low       Close  \
Date
2025-02-13 00:00:00-05:00  236.910004  242.339996  235.570007  241.529999
2025-02-14 00:00:00-05:00  241.250000  245.550003  240.990005  244.600006
2025-02-18 00:00:00-05:00  244.149994  245.179993  241.839996  244.470001
2025-02-19 00:00:00-05:00  244.660004  246.009995  243.160004  244.869995
2025-02-20 00:00:00-05:00  244.940002  246.779999  244.289993  245.830002
2025-02-21 00:00:00-05:00  245.949997  248.690002  245.220001  245.550003
2025-02-24 00:00:00-05:00  244.929993  248.860001  244.419998  247.100006
2025-02-25 00:00:00-05:00  248.000000  250.000000  244.910004  247.039993
2025-02-26 00:00:00-05:00  244.330002  244.979996  239.130005  240.360001
2025-02-27 00:00:00-05:00  239.410004  242.460007  237.059998  237.300003
2025-02-28 00:00:00-05:00  236.949997  242.089996  230.199997  241.839996
2025-03-03 00:00:00-05:00  241.789993  244.029999  236.110001  238.029999
2025-03-04 00:00:00-05:00  237.710007  240.070007  234.679993  235.929993
2025-03-05 00:00:00-05:00  235.419998  236.550003  229.229996  235.740005
2025-03-06 00:00:00-05:00  234.440002  237.860001  233.160004  235.330002
2025-03-07 00:00:00-05:00  235.110001  241.369995  234.759995  239.070007
2025-03-10 00:00:00-04:00  235.539993  236.160004  224.220001  227.479996
2025-03-11 00:00:00-04:00  223.809998  225.839996  217.449997  220.839996
2025-03-12 00:00:00-04:00  220.139999  221.750000  214.910004  216.979996

                             Volume  Dividends  Stock Splits
Date
2025-02-13 00:00:00-05:00  53614100        0.0           0.0
2025-02-14 00:00:00-05:00  40896200        0.0           0.0
2025-02-18 00:00:00-05:00  48822500        0.0           0.0
2025-02-19 00:00:00-05:00  32204200        0.0           0.0
2025-02-20 00:00:00-05:00  32316900        0.0           0.0
2025-02-21 00:00:00-05:00  53197400        0.0           0.0
2025-02-24 00:00:00-05:00  51326400        0.0           0.0
2025-02-25 00:00:00-05:00  48013300        0.0           0.0
2025-02-26 00:00:00-05:00  44433600        0.0           0.0
2025-02-27 00:00:00-05:00  41153600        0.0           0.0
2025-02-28 00:00:00-05:00  56833400        0.0           0.0
2025-03-03 00:00:00-05:00  47184000        0.0           0.0
2025-03-04 00:00:00-05:00  53798100        0.0           0.0
2025-03-05 00:00:00-05:00  47227600        0.0           0.0
2025-03-06 00:00:00-05:00  45170400        0.0           0.0
2025-03-07 00:00:00-05:00  46273600        0.0           0.0
2025-03-10 00:00:00-04:00  72071200        0.0           0.0
2025-03-11 00:00:00-04:00  76137400        0.0           0.0
2025-03-12 00:00:00-04:00  62466400        0.0           0.0

In [20]:
type(history.iloc[9])

pandas.core.series.Series

In [ ]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                   'Florida': 170312, 'New York': 141297,
                    'Pennsylvania': 119280})
pop = pd.Series({'California': 39538223, 'Texas': 29145505,
                 'Florida': 21538187, 'New York': 20201249,
                 'Pennsylvania': 13002700})
data = pd.DataFrame({'area':area, 'pop':pop})
data

                area       pop
California    423967  39538223
Texas         695662  29145505
Florida       170312  21538187
New York      141297  20201249
Pennsylvania  119280  13002700

In [22]:
data['area']

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

In [23]:
data.area

California      423967
Texas           695662
Florida         170312
New York        141297
Pennsylvania    119280
Name: area, dtype: int64

In [24]:
data['density'] = data['pop']/data['area']
print(data)

                area       pop     density
California    423967  39538223   93.257784
Texas         695662  29145505   41.896072
Florida       170312  21538187  126.463121
New York      141297  20201249  142.970120
Pennsylvania  119280  13002700  109.009893

In [34]:
df = pd.DataFrame({'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df.index = ['r1','r2','r3']
df

    A  B  C
r1  1  4  7
r2  2  5  8
r3  3  6  9

In [35]:
df['D']=[8,9,1]
df

    A  B  C  D
r1  1  4  7  8
r2  2  5  8  9
r3  3  6  9  1

In [36]:
df.loc['r4'] = [3,2,4,5]
df

    A  B  C  D
r1  1  4  7  8
r2  2  5  8  9
r3  3  6  9  1
r4  3  2  4  5

In [37]:
df.drop(columns=['A','D'], inplace=True)
df

    B  C
r1  4  7
r2  5  8
r3  6  9
r4  2  4

In [38]:
df.drop(index=['r2','r4'], inplace=True)
df

    B  C
r1  4  7
r3  6  9

### **Exercise:** Given a Series of five countries and their populations, retrieve the population of a specific country using `.loc[]`.


            ### **AI Prompt: Mastering Indexing**
            - What is the difference between `.loc[]` and `.iloc[]` in Pandas?
            - How can incorrect indexing lead to errors in data analysis?
            - Generate a challenging indexing problem and explain how to solve it.

## 5. Handling Missing Data

Pandas allows handling missing values using `fillna()` or `dropna()`.

In [39]:
df_missing = pd.DataFrame({'A': [1, 2, None], 'B': [None, 3, 4]})
df_filled = df_missing.fillna(0)
print(df_filled)

     A    B
0  1.0  0.0
1  2.0  3.0
2  0.0  4.0

### **Exercise:** Create a DataFrame with missing values and replace them with the column mean.


            ### **AI Prompt: Handling Missing Data**
            - Why is handling missing data important in real-world datasets?
            - Compare the differences between `.fillna()`, `.dropna()`, and `.interpolate()`.
            - What are some strategies for handling missing categorical values?

In [54]:
data = {'Name': ['John', 'Anna', 'Peter', 'Linda', 'James'],
        'Age': [28, 22, np.nan, 32, 25],
        'City': ['New York', 'Paris', 'Berlin', np.nan, 'London'],
        'Salary': [70000, np.nan, 60000, 85000, np.nan]}
df = pd.DataFrame(data)
df

    Name   Age      City   Salary
0   John  28.0  New York  70000.0
1   Anna  22.0     Paris      NaN
2  Peter   NaN    Berlin  60000.0
3  Linda  32.0       NaN  85000.0
4  James  25.0    London      NaN

In [55]:
df.isnull().sum()

Name      0
Age       1
City      1
Salary    2
dtype: int64

In [59]:
#df.dropna(inplace=True, axis=1)
mean_sa = df['Salary'].dropna().mean()
df['Salary'].fillna(mean_sa, inplace=True)
df

C:\Users\Admin\AppData\Local\Temp\ipykernel_10688\3046165323.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(mean_sa, inplace=True)

    Name   Age      City        Salary
0   John  28.0  New York  70000.000000
1   Anna  22.0     Paris  71666.666667
2  Peter   NaN    Berlin  60000.000000
3  Linda  32.0       NaN  85000.000000
4  James  25.0    London  71666.666667

In [60]:
data = {'Name': ['John', 'Anna', 'Peter', 'Linda', 'James'],
        'Age': [28, 22, np.nan, 32, 25],
        'City': ['New York', 'Paris', 'Berlin', np.nan, 'London'],
        'Salary': [70000, np.nan, 60000, 85000, np.nan]}
df = pd.DataFrame(data)
print(df)

    Name   Age      City   Salary
0   John  28.0  New York  70000.0
1   Anna  22.0     Paris      NaN
2  Peter   NaN    Berlin  60000.0
3  Linda  32.0       NaN  85000.0
4  James  25.0    London      NaN

In [61]:
df['Salary'].fillna(method='backfill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_10688\1545071253.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Salary'].fillna(method='backfill')

0    70000.0
1    60000.0
2    60000.0
3    85000.0
4        NaN
Name: Salary, dtype: float64

In [62]:
df['Salary'].fillna(method='ffill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_10688\2287196102.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Salary'].fillna(method='ffill')

0    70000.0
1    70000.0
2    60000.0
3    85000.0
4    85000.0
Name: Salary, dtype: float64

In [63]:
df

    Name   Age      City   Salary
0   John  28.0  New York  70000.0
1   Anna  22.0     Paris      NaN
2  Peter   NaN    Berlin  60000.0
3  Linda  32.0       NaN  85000.0
4  James  25.0    London      NaN

## 6. MultiIndex (Hierarchical Indexing)

MultiIndex allows working with hierarchical data efficiently.

In [57]:
index = [('California', 2000), ('California', 2010), ('New York', 2000)]
populations = [33871648, 37253956, 18976457]
ind = pd.MultiIndex.from_tuples(index, names=('State', 'Year'))
df_multi = pd.DataFrame({'Population': populations}, index=ind)
print(df_multi)

                 Population
State      Year
California 2000    33871648
           2010    37253956
New York   2000    18976457

### **Exercise:** Create a MultiIndex DataFrame for sales data across multiple years and retrieve sales for a specific year.


            ### **AI Prompt: Exploring MultiIndex**
            - When should you use MultiIndex instead of a simple index?
            - How does MultiIndex impact performance in large datasets?
            - Can you create a dataset where MultiIndexing is necessary?

## Final Comprehensive Exercise

- Create a dataset of 10 employees with **Name, Age, Department, Salary, and Year of Joining**.
- Retrieve employees in a specific department.
- Fill missing salaries with the department average.
- Create a MultiIndex grouping employees by **Department and Year of Joining**.
- Display the department with the highest average salary.

In [65]:
df_president = pd.read_csv('Data\Data_DS_Handbook\president_heights.csv')
df_president.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [66]:
df_president.tail(10)

    order               name  height(cm)
32     35    John F. Kennedy         183
33     36  Lyndon B. Johnson         193
34     37      Richard Nixon         182
35     38        Gerald Ford         183
36     39       Jimmy Carter         177
37     40      Ronald Reagan         185
38     41  George H. W. Bush         188
39     42       Bill Clinton         188
40     43     George W. Bush         182
41     44       Barack Obama         185